[
    {   "id":1,
        "title":"Tech Exchange",
        "title1": "Resale Market site",
        "img1":"https://i.ibb.co/YhW3wdC/project1img1.png",
        "img2":"https://i.ibb.co/tcnfTn3/project1img2.png",
        "img3":"https://i.ibb.co/R9HsbHn/project1img3.png",
        "img4":"https://i.ibb.co/n8hjtzM/project1img4.png",
        "description": "Tech exchange is a website for buying old mobiles. Buyers can buy old mobiles through this website. the first home page has 3 categories, if you click on the category button we can see the category products.",
        "fulldescription1":"Tech exchange is a website for buying old mobiles. Buyers can buy old mobiles through this website. first home page there are 3 categories, if you click on the category button we can see the category products but before that, we have to register as a buyer and seller.",
        "fulldescription2":"If the buyer is registered as a buyer, the buyer can only buy, and if the seller is registered as a seller, the seller can only add the product to be sold.",
        "fulldescription3":"After the buyer registers, he clicks on a category You can see the category products. Now if the buyer makes a product or wishlist, then those products will go to the add product page, from where the buyer can make the payment and after the buyer makes the payment, the buyer will be given a successful message. ",
        "fulldescription4":"Now, if the seller wants to add a product, then the seller must register as a seller. The seller will be able to advertise his product again and will not show the products that are sold.",
        "fulldescription5":"admin is set here by default. Admin can delete any buyer and seller if he wants. Again, the admin can verify a seller. The last blog section has given some questions to answer.",
        "livelink": "https://used-products-resale-45da8.web.app/",
        "githublink": "https://github.com/Mihir160/b612-used-products-resale-clients-side",
        "githubserverlink":"https://github.com/Mihir160/b612-used-products-resale-server-side"
    },
    {
        "id":2,
        "title":"XtreameClean",
        "title1":"A personal cleaning service website",
        "img1":"https://i.ibb.co/WDXfYtd/project2img1.png",
        "img2":"https://i.ibb.co/cwhWS0c/project2img2.png",
        "img3":"https://i.ibb.co/QXQNv3V/project2img3.png",
        "img4":"https://i.ibb.co/CvTXSZf/project2img4.png",
        "description": "House office and other cleaning service websites. When we go to the home page, we see only three services. If we click to see all then we will get all services.",
        "fulldescription1":"House office and other cleaning service websites. When we go to the home page, we see only three services. If we click to see all then we will get all services.",
        "fulldescription2":"You click the see all button that has details in the service cards, and it will go to details here there are two sections details and review.",
        "fulldescription3":"The service will show all the details in the details section and the client's feedback in the review section.",
        "fulldescription4":"We add a review, if we want to do it, we have to log in. Review cannot be added if not logged in. If we go to my review now we can see our reviews.",
        "fulldescription5":"If we go to add service, we can add additional service. After going to the blog, I can see the blog questions.",
        "livelink": "https://b6a11-service-review.web.app/",
        "githublink": "https://github.com/Mihir160/b6a11-service-review-client-side",
        "githubserverlink":"https://github.com/Mihir160/b6a11-service-review-server-side" 
    }
    ,
    {   "id":3,
        "title":"Code Stack",
        "title1":"Online Learning platform site",
        "img1":"https://i.ibb.co/K6zry2J/project3img1.png",
        "img2":"https://i.ibb.co/nDT2vqG/project3img2.png",
        "img3":"https://i.ibb.co/4tY7k7s/project3img3.png",
        "img4":"https://i.ibb.co/XL1jc2b/project3img4.png",
        "description": "We can purchase different types of courses through this website. If we click course then it will show how many courses there are.",
        "fulldescription1":"We can purchase different types of courses through this website. If we click course then it will show how many courses there are.",
        "fulldescription2":"Now if you click on the course names on the left side, the course detail will go. If we get to the end of the course cards If you click the button, you will go to the details button.",
        "fulldescription3":"There is a button called premium access below the course details. Clicking the premium access button will take you to the checkout page.",
        "fulldescription4":"If we go to the login page we can log in. We have an account and We can also log in with google, email, and password, GitHub.If there is no account then we click register If you do, it will take you to the register page and you can register.",
        "fulldescription5":"After that, if you go to the blog, you will get some questions answered and if you go to faqs, the questions you have about the course will be answered.",
        "githublink": "https://github.com/Mihir160/b610-learning-platform-client-side",
        "githubserverlink":"https://github.com/Mihir160/b610-lerning-platform-server-side" 
    }

]